backend/artillery/performance/search_performance_test.yml
# Search Domain Performance Test
# 최적: 100ms 이하 (즉각적인 응답)
# ✅ 양호: 200ms 이하 (대부분의 사용자에게 원활하게 느껴짐)
# 허용 가능: 500ms 이하 (약간의 지연이 있더라도 사용자에게 큰 불편을 주지 않음)
# 주의: 1초 이상 (사용자 경험에 큰 영향을 줄 수 있음, 반응이 느리다고 느껴짐)

config:
  target: http://127.0.0.1:8080
  phases:
    - duration: 10
      arrivalRate: 1
      name: warm-up
    - duration: 20
      arrivalRate: 1
      name: Sustained

scenarios:
  - name: "Service Domain Performance Test"
    flow:
      # 모임 리스트 조회
      - get:
          url: "/api/v1/search/classes"
      # 로그인 회원의 관심사 기반 모임 리스트 조회
      - get:
          url: "/api/v1/search/favorite"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiJ9.eyJjYXRlZ29yeSI6ImFjY2Vzc1Rva2VuIiwidXNlcklkIjoiMSIsInJvbGUiOiJST0xFX1VTRVIiLCJpYXQiOjE3NDE1NzQ3MjcsImV4cCI6MTc0NDU3NDcyN30.i5CTEsK2luPF6mxk6MXORdkutna8txQxgNKeioqF0d8"